---
title: AnalysisDisplayDeformedShapeSettings
classe: Autodesk.Revit.DB.Analysis.AnalysisDisplayDeformedShapeSettings
namespace: Autodesk.Revit.DB.Analysis
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 11
---

# AnalysisDisplayDeformedShapeSettings

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Color GridColor { get; set; }` | `analysisDisplayDeformedShapeSettings.GridColor` | Color |
| `Int32 GridLineWeight { get; set; }` | `analysisDisplayDeformedShapeSettings.GridLineWeight` | Int32 |
| `Boolean IsValidObject { get; }` | `analysisDisplayDeformedShapeSettings.IsValidObject` | Boolean |
| `Double Rounding { get; set; }` | `analysisDisplayDeformedShapeSettings.Rounding` | Double |
| `Boolean ShowContourLines { get; set; }` | `analysisDisplayDeformedShapeSettings.ShowContourLines` | Boolean |
| `Boolean ShowGridLines { get; set; }` | `analysisDisplayDeformedShapeSettings.ShowGridLines` | Boolean |
| `AnalysisDisplayStyleDeformedShapeTextLabelType TextLabelType { get; set; }` | `analysisDisplayDeformedShapeSettings.TextLabelType` | AnalysisDisplayStyleDeformedShapeTextLabelType |
| `ElementId TextTypeId { get; set; }` | `analysisDisplayDeformedShapeSettings.TextTypeId` | ElementId |
| `Int32 Transparency { get; set; }` | `analysisDisplayDeformedShapeSettings.Transparency` | Int32 |
| `Void Dispose()` | `analysisDisplayDeformedShapeSettings.Dispose()` | Void |
| `Boolean IsEqual(AnalysisDisplayDeformedShapeSettings)` | `analysisDisplayDeformedShapeSettings.IsEqual(other)` | Boolean |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```